per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}

money = float(input("Какую сумму хотите положить на вклад? :"))

print("В 'ТКБ' вы получите за год: " '%d' % (money / 100 * per_cent.get("ТКБ")) + " рублей" "\n"
      "В 'СКБ' вы получите за год: " '%d' % (money / 100 * per_cent.get("СКБ")) + " рублей" "\n"
      "В 'ВТБ' вы получите за год: " '%d' % (money / 100 * per_cent.get("ВТБ")) + " рублей" "\n"
      "В 'СБЕР' вы получите за год: " '%d' % (money / 100 * per_cent.get("СБЕР")) + " рублей")

deposit = max((money / 100 * per_cent.get("ТКБ")),
          (money / 100 * per_cent.get("СКБ")),
          (money / 100 * per_cent.get("ВТБ")),
          (money / 100 * per_cent.get("СБЕР")))

print("Максимальная сумма, которую вы можете заработать —", (deposit))